docs/new-system/business-diagrams/plantuml/use-case-admin.puml
@startuml
left to right direction
actor "Admin" as Admin
rectangle "Admin application (outside scope)" {
  usecase "Create Wealth Manager" as UC1
  usecase "Create Seller" as UC2
  usecase "Create Distributor" as UC3
  usecase "Create Retailer" as UC4
  usecase "Assign WM investment areas" as UC5
  usecase "Create company" as UC6
  usecase "View all data" as UC7
}
Admin --> UC1
Admin --> UC2
Admin --> UC3
Admin --> UC4
Admin --> UC5
Admin --> UC6
Admin --> UC7
note right of UC3 : Parent not mandatory
@enduml
